##SyntaxError: 구문 자체를 잘못 사용
#print("안녕하세요"
#"안녕하세요
#
##TypeError: 연산자가 적용되는 자료형을 잘못 사용
#"안녕하세요" + 50
#
##IndexError: 범위를 넘는 부분을 선택
#print("안녕하세요"[10])
#print("안녕하세요"[5])

# 문자 범위 선택 연산자: [:]
# <문자열>[<숫자>:<숫자>]
# print("안녕하세요"[-4:-2]) #
# print("안녕하세요"[-2:-4]) #
# -4: 녕
# -2: 세



## 마지막 숫자 포함
## 마지막 숫자 포함하지 않음 → 파이썬
## 1번째 + 2번째 + 3번째
#
## 문자열 연결 연산자: +
## <문자열> + <문자열>
## NG: <숫자> + <문자열>
#print("안녕" + "하세요") # "안녕하세요"
#
## 문자열 반복 연산자: *
## <숫자> * <문자열> or <문자열> * <숫자>
#print("안녕" * 3) # "안녕안녕안녕"

# 문자 선택 연산자: []
# <문자열>[<숫자>]
#print("안녕하세요"[-1]) #요
#print("안녕하세요"[-2]) #세
#print("안녕하세요"[-3]) #하
#print("안녕하세요"[-4]) #녕
#print("안녕하세요"[-5]) #안











